[A_Creature_t6_base H7Creature]
mName="风暴骑士"
mLore="来自遥远的阿尔玛什，势不可挡的联盟骑兵正在逼近。听啊，伴随着雷鸣电闪，风暴骑士骠骑兵们来了。通过呼唤佩雷努，伊拉斯的雷暴面相被闪电、雨水和寒冷所驯服。据说 500 名风暴骑士就足以击败 4000 名最强悍的部队。他们总是伴随着闪电、暴雨和可怕的呼啸风。由于守护龙的祝福，他们可以像一阵冰冷的风暴般穿过敌军，用恐惧麻痹他们。"

[A_Creature_t6_lv2 H7Creature]
mName="暴雪骑士"
mLore="当娜迦并入联盟后，她们教导风暴骑士骠骑兵的指挥官们驯服雨水、雪、霜、冰和冰雹之水。精英暴雪骑士小队就是这样创建的。通过呼唤佩雷努和玛夏纳，他们获得了雷龙和雪龙的祝福。他们不想防御他们的对手，因为当他们出击时，就如同一个锁着闪电的冰球被击碎。"

[A_Glaciation_Buff H7BaseBuff]
mName="冰上行者"
mTooltip=""

[Ability.A_aura_givreante H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="冰上行者"
mTooltip="该生物可以穿过任何其他生物，当穿过敌方生物时，对部队中的每个生物造成 %buff1.buff.d.min %icon_water 点水属性伤害。\n此单位有 50% 几率冻结穿过的敌人。"

[Ability.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="霜寒尖峰"
mTooltip="所有被冻结的敌方生物承受 %d %ICON_Water 点水属性伤害。\n每场战斗一次。"

v1.37

[Ability.A_Glacial_Presence H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="冰川威压"
mTooltip="在每个回合开始时，相邻的敌方生物根据此生物的冷血等级受到惩罚，持续至其回合结束：\n无：%buff4.buff.stat1 %ICON_MORALE / %buff4.buff.stat2 %ICON_attack / %buff4.buff.stat3 %ICON_Defense\n等级1：%buff1.buff.stat1 %ICON_MORALE / %buff1.buff.stat2 %ICON_attack / %buff1.buff.stat3 %ICON_Defense\n等级2：%buff2.buff.stat1 %ICON_MORALE / %buff2.buff.stat2 %ICON_attack / %buff2.buff.stat3 %ICON_Defense\n等级3：%buff3.buff.stat1 %ICON_MORALE / %buff3.buff.stat2 %ICON_attack / %buff3.buff.stat3 %ICON_Defense"

[Ability.A_Glacial_Presence_Buff_no_skill H7BaseBuff]
mName="冰川威压"
mTooltip="%stat1 %ICON_MORALE 士气，%stat2 %icon_attack 攻击，%stat3 %ICON_Defense 防御，持续 %durnow 回合。"

[Ability.A_Glacial_Presence_Buff_novice H7BaseBuff]
mName="冰川威压 I"
mTooltip="%stat1 %ICON_MORALE 士气，%stat2 %icon_attack 攻击，%stat3 %ICON_Defense 防御，持续 %durnow 回合。"

[Ability.A_Glacial_Presence_Buff_expert H7BaseBuff]
mName="冰川威压 II"
mTooltip="%stat1 %ICON_MORALE 士气，%stat2 %icon_attack 攻击，%stat3 %ICON_Defense 防御，持续 %durnow 回合。"

[Ability.A_Glacial_Presence_Buff_master H7BaseBuff]
mName="冰川威压 III"
mTooltip="%stat1 %ICON_MORALE 士气，%stat2 %icon_attack 攻击，%stat3 %ICON_Defense 防御，持续 %durnow 回合。"